9. Test Script Recorder Правительство РФ/ResRec-10/statistics.json
{
  "http://government.ru/meetings/" : {
    "transaction" : "http://government.ru/meetings/",
    "sampleCount" : 10,
    "errorCount" : 6,
    "errorPct" : 60.0,
    "meanResTime" : 14721.6,
    "medianResTime" : 19197.5,
    "minResTime" : 72.0,
    "maxResTime" : 31695.0,
    "pct1ResTime" : 30451.200000000004,
    "pct2ResTime" : 31695.0,
    "pct3ResTime" : 31695.0,
    "throughput" : 0.3155071777882947,
    "receivedKBytesPerSec" : 11.947492703896513,
    "sentKBytesPerSec" : 0.045847136772361574
  },
  "http://government.ru/news/" : {
    "transaction" : "http://government.ru/news/",
    "sampleCount" : 10,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 7475.4,
    "medianResTime" : 218.5,
    "minResTime" : 153.0,
    "maxResTime" : 30774.0,
    "pct1ResTime" : 29814.600000000006,
    "pct2ResTime" : 30774.0,
    "pct3ResTime" : 30774.0,
    "throughput" : 0.3183294072706436,
    "receivedKBytesPerSec" : 29.017404162952822,
    "sentKBytesPerSec" : 0.11439963073788756
  },
  "Test" : {
    "transaction" : "Test",
    "sampleCount" : 10,
    "errorCount" : 6,
    "errorPct" : 60.0,
    "meanResTime" : 22651.4,
    "medianResTime" : 20141.5,
    "minResTime" : 19719.0,
    "maxResTime" : 32233.0,
    "pct1ResTime" : 32118.6,
    "pct2ResTime" : 32233.0,
    "pct3ResTime" : 32233.0,
    "throughput" : 0.30548342752405677,
    "receivedKBytesPerSec" : 99.7520930387964,
    "sentKBytesPerSec" : 0.4859095769054529
  },
  "http://government.ru/docs/" : {
    "transaction" : "http://government.ru/docs/",
    "sampleCount" : 10,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 166.8,
    "medianResTime" : 163.0,
    "minResTime" : 105.0,
    "maxResTime" : 345.0,
    "pct1ResTime" : 327.30000000000007,
    "pct2ResTime" : 345.0,
    "pct3ResTime" : 345.0,
    "throughput" : 0.5333048904058451,
    "receivedKBytesPerSec" : 49.97598044770945,
    "sentKBytesPerSec" : 0.19165644498960055
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 50,
    "errorCount" : 6,
    "errorPct" : 12.0,
    "meanResTime" : 4530.279999999999,
    "medianResTime" : 163.0,
    "minResTime" : 38.0,
    "maxResTime" : 31695.0,
    "pct1ResTime" : 19252.4,
    "pct2ResTime" : 25497.29999999996,
    "pct3ResTime" : 31695.0,
    "throughput" : 1.1295095669460322,
    "receivedKBytesPerSec" : 73.76566665066528,
    "sentKBytesPerSec" : 0.3593252309847064
  },
  "http://government.ru/activities/" : {
    "transaction" : "http://government.ru/activities/",
    "sampleCount" : 10,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 150.19999999999996,
    "medianResTime" : 102.0,
    "minResTime" : 38.0,
    "maxResTime" : 431.0,
    "pct1ResTime" : 426.5,
    "pct2ResTime" : 431.0,
    "pct3ResTime" : 431.0,
    "throughput" : 0.5902839265686796,
    "receivedKBytesPerSec" : 30.75759713859867,
    "sentKBytesPerSec" : 0.2155919809928576
  },
  "http://government.ru/orders/" : {
    "transaction" : "http://government.ru/orders/",
    "sampleCount" : 10,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 137.39999999999998,
    "medianResTime" : 99.0,
    "minResTime" : 95.0,
    "maxResTime" : 412.0,
    "pct1ResTime" : 388.30000000000007,
    "pct2ResTime" : 412.0,
    "pct3ResTime" : 412.0,
    "throughput" : 0.5475251861585633,
    "receivedKBytesPerSec" : 28.306624370346036,
    "sentKBytesPerSec" : 0.19783624890494964
  }
}