9. Test Script Recorder Правительство РФ/ResRec-2/statistics.json
{
  "http://government.ru/meetings/" : {
    "transaction" : "http://government.ru/meetings/",
    "sampleCount" : 4,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 881.0,
    "medianResTime" : 678.5,
    "minResTime" : 71.0,
    "maxResTime" : 2096.0,
    "pct1ResTime" : 2096.0,
    "pct2ResTime" : 2096.0,
    "pct3ResTime" : 2096.0,
    "throughput" : 0.9391876027236441,
    "receivedKBytesPerSec" : 85.38444323784925,
    "sentKBytesPerSec" : 0.3411892463019488
  },
  "http://government.ru/news/" : {
    "transaction" : "http://government.ru/news/",
    "sampleCount" : 4,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 206.0,
    "medianResTime" : 150.0,
    "minResTime" : 140.0,
    "maxResTime" : 384.0,
    "pct1ResTime" : 384.0,
    "pct2ResTime" : 384.0,
    "pct3ResTime" : 384.0,
    "throughput" : 3.7037037037037037,
    "receivedKBytesPerSec" : 337.61212384259255,
    "sentKBytesPerSec" : 1.3310185185185184
  },
  "Test" : {
    "transaction" : "Test",
    "sampleCount" : 4,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2992.5,
    "medianResTime" : 3003.0,
    "minResTime" : 1526.0,
    "maxResTime" : 4438.0,
    "pct1ResTime" : 4438.0,
    "pct2ResTime" : 4438.0,
    "pct3ResTime" : 4438.0,
    "throughput" : 0.7719027402547279,
    "receivedKBytesPerSec" : 293.0019176958703,
    "sentKBytesPerSec" : 1.3960584716325741
  },
  "http://government.ru/docs/" : {
    "transaction" : "http://government.ru/docs/",
    "sampleCount" : 4,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 504.5,
    "medianResTime" : 440.5,
    "minResTime" : 127.0,
    "maxResTime" : 1010.0,
    "pct1ResTime" : 1010.0,
    "pct2ResTime" : 1010.0,
    "pct3ResTime" : 1010.0,
    "throughput" : 0.5391562205148942,
    "receivedKBytesPerSec" : 50.52430836366087,
    "sentKBytesPerSec" : 0.1937592667475401
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 20,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 598.5,
    "medianResTime" : 150.5,
    "minResTime" : 66.0,
    "maxResTime" : 2412.0,
    "pct1ResTime" : 2052.2000000000007,
    "pct2ResTime" : 2396.2,
    "pct3ResTime" : 2412.0,
    "throughput" : 1.2914890869172155,
    "receivedKBytesPerSec" : 98.04571467777347,
    "sentKBytesPerSec" : 0.46715581815833657
  },
  "http://government.ru/activities/" : {
    "transaction" : "http://government.ru/activities/",
    "sampleCount" : 4,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 683.75,
    "medianResTime" : 128.5,
    "minResTime" : 66.0,
    "maxResTime" : 2412.0,
    "pct1ResTime" : 2412.0,
    "pct2ResTime" : 2412.0,
    "pct3ResTime" : 2412.0,
    "throughput" : 0.7643798968087139,
    "receivedKBytesPerSec" : 39.82911929103765,
    "sentKBytesPerSec" : 0.27917781387349516
  },
  "http://government.ru/orders/" : {
    "transaction" : "http://government.ru/orders/",
    "sampleCount" : 4,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 717.25,
    "medianResTime" : 556.0,
    "minResTime" : 99.0,
    "maxResTime" : 1658.0,
    "pct1ResTime" : 1658.0,
    "pct2ResTime" : 1658.0,
    "pct3ResTime" : 1658.0,
    "throughput" : 0.48822165263029416,
    "receivedKBytesPerSec" : 25.24067801782009,
    "sentKBytesPerSec" : 0.1764082143293055
  }
}