9. Test Script Recorder Правительство РФ/ResRec-4/statistics.json
{
  "http://government.ru/meetings/" : {
    "transaction" : "http://government.ru/meetings/",
    "sampleCount" : 10,
    "errorCount" : 4,
    "errorPct" : 40.0,
    "meanResTime" : 7793.5,
    "medianResTime" : 374.5,
    "minResTime" : 73.0,
    "maxResTime" : 19250.0,
    "pct1ResTime" : 19247.0,
    "pct2ResTime" : 19250.0,
    "pct3ResTime" : 19250.0,
    "throughput" : 0.3196011377800505,
    "receivedKBytesPerSec" : 17.753655937390135,
    "sentKBytesPerSec" : 0.06966306050049538
  },
  "http://government.ru/news/" : {
    "transaction" : "http://government.ru/news/",
    "sampleCount" : 10,
    "errorCount" : 1,
    "errorPct" : 10.0,
    "meanResTime" : 9425.6,
    "medianResTime" : 163.0,
    "minResTime" : 143.0,
    "maxResTime" : 30732.0,
    "pct1ResTime" : 29872.700000000004,
    "pct2ResTime" : 30732.0,
    "pct3ResTime" : 30732.0,
    "throughput" : 0.31880638888003315,
    "receivedKBytesPerSec" : 26.234621327748908,
    "sentKBytesPerSec" : 0.10311394140338571
  },
  "Test" : {
    "transaction" : "Test",
    "sampleCount" : 10,
    "errorCount" : 6,
    "errorPct" : 60.0,
    "meanResTime" : 23506.0,
    "medianResTime" : 21626.0,
    "minResTime" : 19782.0,
    "maxResTime" : 31088.0,
    "pct1ResTime" : 31086.5,
    "pct2ResTime" : 31088.0,
    "pct3ResTime" : 31088.0,
    "throughput" : 0.3148912050886418,
    "receivedKBytesPerSec" : 102.72839698727839,
    "sentKBytesPerSec" : 0.5011198318480965
  },
  "http://government.ru/docs/" : {
    "transaction" : "http://government.ru/docs/",
    "sampleCount" : 10,
    "errorCount" : 1,
    "errorPct" : 10.0,
    "meanResTime" : 5619.099999999999,
    "medianResTime" : 769.0,
    "minResTime" : 71.0,
    "maxResTime" : 30647.0,
    "pct1ResTime" : 29503.9,
    "pct2ResTime" : 30647.0,
    "pct3ResTime" : 30647.0,
    "throughput" : 0.31813698978780264,
    "receivedKBytesPerSec" : 26.911002916918527,
    "sentKBytesPerSec" : 0.10289743263449241
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 50,
    "errorCount" : 6,
    "errorPct" : 12.0,
    "meanResTime" : 4701.200000000001,
    "medianResTime" : 162.0,
    "minResTime" : 38.0,
    "maxResTime" : 30732.0,
    "pct1ResTime" : 19256.3,
    "pct2ResTime" : 25967.599999999962,
    "pct3ResTime" : 30732.0,
    "throughput" : 1.2542959636755888,
    "receivedKBytesPerSec" : 81.83894095088178,
    "sentKBytesPerSec" : 0.39921888718862103
  },
  "http://government.ru/activities/" : {
    "transaction" : "http://government.ru/activities/",
    "sampleCount" : 10,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 314.5,
    "medianResTime" : 98.0,
    "minResTime" : 38.0,
    "maxResTime" : 1709.0,
    "pct1ResTime" : 1580.7000000000005,
    "pct2ResTime" : 1709.0,
    "pct3ResTime" : 1709.0,
    "throughput" : 0.713165026387106,
    "receivedKBytesPerSec" : 37.160494446227354,
    "sentKBytesPerSec" : 0.26047238268435313
  },
  "http://government.ru/orders/" : {
    "transaction" : "http://government.ru/orders/",
    "sampleCount" : 10,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 353.29999999999995,
    "medianResTime" : 103.5,
    "minResTime" : 72.0,
    "maxResTime" : 1865.0,
    "pct1ResTime" : 1750.7000000000005,
    "pct2ResTime" : 1865.0,
    "pct3ResTime" : 1865.0,
    "throughput" : 0.7036802476954472,
    "receivedKBytesPerSec" : 36.379719055661106,
    "sentKBytesPerSec" : 0.2542594644993315
  }
}